"""
Реализовать формирование списка, используя функцию range() и возможности генератора.
В список должны войти четные числа от 100 до 1000 (включая границы).
Необходимо получить результат вычисления произведения всех элементов списка.
Подсказка: использовать функцию reduce().
"""
import operator
from functools import reduce

print(reduce(operator.mul, [digit for digit in range(100, 1001) if digit % 2 == 0]))
