"""
Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах*ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
"""
from sys import argv

_, hours, rate, premium = argv
print(f'ЗП составляет: {hours} * {rate} + {premium} = {float(hours) * float(rate) + float(premium)}')
